# Read csv file and show the data

In [2]:
import pandas as pd

dtypes = {
    "first_name": "category",
    "gender": "category",
    "type": "category",
    "state": "category",
    "party": "category",
}
df = pd.read_csv(
    "data/groupby/legislators-historical.csv",
    dtype=dtypes,
    usecols=list(dtypes) + ["birthday", "last_name"],
    parse_dates=["birthday"],
)
df.head()

  last_name  first_name   birthday gender type state                party
0   Bassett     Richard 1745-04-02      M  sen    DE  Anti-Administration
1     Bland  Theodorick 1742-03-21      M  rep    VA                  NaN
2     Burke     Aedanus 1743-06-16      M  rep    SC                  NaN
3   Carroll      Daniel 1730-07-22      M  rep    MD                  NaN
4    Clymer      George 1739-03-16      M  rep    PA                  NaN

# Show the end of data

In [3]:
df.tail()

         last_name first_name   birthday gender type state       party
12051        Young        Don 1933-06-09      M  rep    AK  Republican
12052  Fortenberry       Jeff 1960-12-27      M  rep    NE  Republican
12053         Vela    Filemon 1963-02-13      M  rep    TX    Democrat
12054         Reed        Tom 1971-11-18      M  rep    NY  Republican
12055      Delgado    Antonio 1977-01-19      M  rep    NY    Democrat

## Types of data and column names

In [5]:
df.dtypes

last_name             object
first_name          category
birthday      datetime64[ns]
gender              category
type                category
state               category
party               category
dtype: object

# Group by `state` column and display the first entry of all the groups formed

In [9]:
state_df = df.groupby("state")
state_df.first().head()

      last_name first_name   birthday gender type       party
state
AK       Waskey      Frank 1875-04-20      M  rep    Democrat
AL      Crowell       John 1780-09-18      M  rep  Republican
AR        Bates      James 1788-08-25      M  rep    Democrat
AS        Sunia       Fofó 1937-03-13      M  rep    Democrat
AZ       Poston    Charles 1825-04-20      M  rep  Republican

# No of groups

In [14]:
state_df.ngroups

58

# List all groups

In [15]:
state_df.groups.keys()

dict_keys(['AK', 'AL', 'AR', 'AS', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'DK', 'FL', 'GA', 'GU', 'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME', 'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM', 'NV', 'NY', 'OH', 'OK', 'OL', 'OR', 'PA', 'PI', 'PR', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT', 'VA', 'VI', 'VT', 'WA', 'WI', 'WV', 'WY'])

# Group size

In [21]:
state_df.size().head(5)

state
AK     17
AL    209
AR    117
AS      2
AZ     49
dtype: int64

# Finding the values contained in the `IL` inside the state group

In [8]:
state_df.get_group("IL")

        last_name first_name   birthday gender type state       party
595          Bond   Shadrack 1773-11-24      M  rep    IL         NaN
772    Stephenson   Benjamin        NaT      M  rep    IL         NaN
860          Pope  Nathaniel 1784-01-05      M  rep    IL         NaN
889       Edwards     Ninian 1775-03-17      M  sen    IL  Republican
1145       Thomas      Jesse        NaT      M  sen    IL       Adams
...           ...        ...        ...    ...  ...   ...         ...
11901   Gutiérrez       Luis 1953-12-10      M  rep    IL    Democrat
11904    Hultgren      Randy 1966-03-01      M  rep    IL  Republican
11922      Roskam      Peter 1961-09-13      M  rep    IL  Republican
11993    Lipinski     Daniel 1966-07-15      M  rep    IL    Democrat
12003     Shimkus       John 1958-02-21      M  rep    IL  Republican

[488 rows x 7 columns]

In [26]:
state_df.last_name.agg(["count"]).sort_values(by=["count"], ascending=False).head(5)

       count
state
NY      1469
PA      1053
OH       676
IL       488
VA       433